vertical-pod-autoscaler/experiments/sn-pbr-throughput/12/compose.log
Running 15m test @ http://10.97.190.48:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 20.359ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 26.890ms, rate sampling interval: 79ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   695.51ms  562.11ms   2.58s    74.42%
    Req/Sec     4.82      8.83    37.00     83.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  566.27ms
 75.000%  961.53ms
 90.000%    1.44s 
 99.000%    2.58s 
 99.900%    3.69s 
 99.990%    4.22s 
 99.999%    4.42s 
100.000%    4.42s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.383     0.000000            1         1.00
     117.311     0.100000          884         1.11
     222.847     0.200000         1767         1.25
     335.615     0.300000         2653         1.43
     441.855     0.400000         3534         1.67
     566.271     0.500000         4418         2.00
     630.271     0.550000         4862         2.22
     703.999     0.600000         5302         2.50
     781.311     0.650000         5745         2.86
     866.815     0.700000         6186         3.33
     962.047     0.750000         6627         4.00
    1017.343     0.775000         6851         4.44
    1079.295     0.800000         7068         5.00
    1155.071     0.825000         7289         5.71
    1231.871     0.850000         7513         6.67
    1330.175     0.875000         7734         8.00
    1378.303     0.887500         7843         8.89
    1435.647     0.900000         7952        10.00
    1494.015     0.912500         8062        11.43
    1577.983     0.925000         8173        13.33
    1673.215     0.937500         8283        16.00
    1725.439     0.943750         8339        17.78
    1791.999     0.950000         8394        20.00
    1840.127     0.956250         8451        22.86
    1932.287     0.962500         8504        26.67
    2024.447     0.968750         8559        32.00
    2080.767     0.971875         8588        35.56
    2134.015     0.975000         8615        40.00
    2209.791     0.978125         8643        45.71
    2291.711     0.981250         8670        53.33
    2394.111     0.984375         8697        64.00
    2439.167     0.985938         8711        71.11
    2480.127     0.987500         8725        80.00
    2535.423     0.989062         8739        91.43
    2598.911     0.990625         8754       106.67
    2689.023     0.992188         8766       128.00
    2736.127     0.992969         8773       142.22
    2815.999     0.993750         8780       160.00
    2852.863     0.994531         8787       182.86
    2906.111     0.995313         8794       213.33
    2961.407     0.996094         8801       256.00
    3014.655     0.996484         8804       284.44
    3096.575     0.996875         8808       320.00
    3151.871     0.997266         8811       365.71
    3307.519     0.997656         8815       426.67
    3373.055     0.998047         8818       512.00
    3430.399     0.998242         8820       568.89
    3493.887     0.998437         8822       640.00
    3522.559     0.998633         8823       731.43
    3651.583     0.998828         8825       853.33
    3786.751     0.999023         8827      1024.00
    3950.591     0.999121         8828      1137.78
    3971.071     0.999219         8829      1280.00
    3971.071     0.999316         8829      1462.86
    4012.031     0.999414         8830      1706.67
    4081.663     0.999512         8831      2048.00
    4153.343     0.999561         8832      2275.56
    4153.343     0.999609         8832      2560.00
    4153.343     0.999658         8832      2925.71
    4202.495     0.999707         8833      3413.33
    4202.495     0.999756         8833      4096.00
    4222.975     0.999780         8834      4551.11
    4222.975     0.999805         8834      5120.00
    4222.975     0.999829         8834      5851.43
    4222.975     0.999854         8834      6826.67
    4222.975     0.999878         8834      8192.00
    4415.487     0.999890         8835      9102.22
    4415.487     1.000000         8835          inf
#[Mean    =      695.505, StdDeviation   =      562.109]
#[Max     =     4411.392, Total count    =         8835]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8952 requests in 15.00m, 1.84MB read
  Socket errors: connect 0, read 0, write 7, timeout 18
Requests/sec:      9.95
Transfer/sec:      2.09KB