vertical-pod-autoscaler/experiments/sn-pbr-throughput/12/home.log
Running 15m test @ http://10.97.190.48:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 10.772ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 7.016ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.41s    14.54s   32.39s    64.21%
    Req/Sec    29.93     37.88   125.00     91.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  331.52ms
 75.000%   29.13s 
 90.000%   30.47s 
 99.000%   32.39s 
 99.900%   33.00s 
 99.990%   33.23s 
 99.999%   33.33s 
100.000%   33.37s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.297     0.000000            1         1.00
      64.287     0.100000         5233         1.11
     109.823     0.200000        10473         1.25
     157.439     0.300000        15710         1.43
     216.831     0.400000        20931         1.67
     331.519     0.500000        26169         2.00
   26017.791     0.550000        28779         2.22
   27475.967     0.600000        31426         2.50
   28065.791     0.650000        34041         2.86
   28639.231     0.700000        36683         3.33
   29130.751     0.750000        39253         4.00
   29360.127     0.775000        40572         4.44
   29573.119     0.800000        41940         5.00
   29786.111     0.825000        43243         5.71
   29982.719     0.850000        44517         6.67
   30212.095     0.875000        45862         8.00
   30326.783     0.887500        46466         8.89
   30474.239     0.900000        47125        10.00
   30638.079     0.912500        47782        11.43
   30834.687     0.925000        48418        13.33
   31031.295     0.937500        49104        16.00
   31113.215     0.943750        49389        17.78
   31227.903     0.950000        49711        20.00
   31358.975     0.956250        50057        22.86
   31506.431     0.962500        50363        26.67
   31686.655     0.968750        50690        32.00
   31768.575     0.971875        50859        35.56
   31850.495     0.975000        51024        40.00
   31932.415     0.978125        51186        45.71
   32047.103     0.981250        51366        53.33
   32178.175     0.984375        51526        64.00
   32227.327     0.985938        51602        71.11
   32292.863     0.987500        51689        80.00
   32358.399     0.989062        51767        91.43
   32407.551     0.990625        51834       106.67
   32489.471     0.992188        51927       128.00
   32522.239     0.992969        51965       142.22
   32571.391     0.993750        52011       160.00
   32620.543     0.994531        52050       182.86
   32669.695     0.995313        52084       213.33
   32718.847     0.996094        52123       256.00
   32751.615     0.996484        52146       284.44
   32784.383     0.996875        52169       320.00
   32817.151     0.997266        52193       365.71
   32833.535     0.997656        52202       426.67
   32882.687     0.998047        52229       512.00
   32899.071     0.998242        52236       568.89
   32915.455     0.998437        52245       640.00
   32948.223     0.998633        52257       731.43
   32964.607     0.998828        52266       853.33
   32997.375     0.999023        52276      1024.00
   33013.759     0.999121        52280      1137.78
   33046.527     0.999219        52287      1280.00
   33062.911     0.999316        52289      1462.86
   33095.679     0.999414        52297      1706.67
   33112.063     0.999512        52300      2048.00
   33128.447     0.999561        52305      2275.56
   33128.447     0.999609        52305      2560.00
   33144.831     0.999658        52310      2925.71
   33144.831     0.999707        52310      3413.33
   33161.215     0.999756        52313      4096.00
   33161.215     0.999780        52313      4551.11
   33177.599     0.999805        52315      5120.00
   33193.983     0.999829        52316      5851.43
   33210.367     0.999854        52317      6826.67
   33226.751     0.999878        52319      8192.00
   33226.751     0.999890        52319      9102.22
   33226.751     0.999902        52319     10240.00
   33243.135     0.999915        52321     11702.86
   33243.135     0.999927        52321     13653.33
   33243.135     0.999939        52321     16384.00
   33275.903     0.999945        52322     18204.44
   33275.903     0.999951        52322     20480.00
   33275.903     0.999957        52322     23405.71
   33325.055     0.999963        52323     27306.67
   33325.055     0.999969        52323     32768.00
   33325.055     0.999973        52323     36408.89
   33325.055     0.999976        52323     40960.00
   33325.055     0.999979        52323     46811.43
   33374.207     0.999982        52324     54613.33
   33374.207     1.000000        52324          inf
#[Mean    =    13407.315, StdDeviation   =    14544.453]
#[Max     =    33357.824, Total count    =        52324]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  52978 requests in 15.00m, 463.39MB read
  Socket errors: connect 0, read 1, write 6, timeout 0
Requests/sec:     58.86
Transfer/sec:    527.21KB