vertical-pod-autoscaler/experiments/sn-pbr-throughput/12/user.log
Running 15m test @ http://10.97.190.48:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 37.230ms, rate sampling interval: 107ms
  Thread calibration: mean lat.: 36.941ms, rate sampling interval: 86ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.00s    11.80s   31.01s    75.44%
    Req/Sec    14.48     12.22    47.00     58.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  318.46ms
 75.000%  995.84ms
 90.000%   27.87s 
 99.000%   31.01s 
 99.900%   32.06s 
 99.990%   33.13s 
 99.999%   33.36s 
100.000%   33.36s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.599     0.000000            1         1.00
     102.399     0.100000         2639         1.11
     151.167     0.200000         5266         1.25
     198.783     0.300000         7898         1.43
     253.695     0.400000        10534         1.67
     318.463     0.500000        13159         2.00
     359.935     0.550000        14477         2.22
     411.903     0.600000        15793         2.50
     477.695     0.650000        17106         2.86
     586.239     0.700000        18420         3.33
     995.839     0.750000        19736         4.00
   25313.279     0.775000        20395         4.44
   26066.943     0.800000        21067         5.00
   26542.079     0.825000        21725         5.71
   27000.831     0.850000        22384         6.67
   27426.815     0.875000        23025         8.00
   27639.807     0.887500        23358         8.89
   27869.183     0.900000        23695        10.00
   28147.711     0.912500        24027        11.43
   28442.623     0.925000        24356        13.33
   28770.303     0.937500        24676        16.00
   28934.143     0.943750        24842        17.78
   29097.983     0.950000        25008        20.00
   29294.591     0.956250        25174        22.86
   29540.351     0.962500        25334        26.67
   29818.879     0.968750        25501        32.00
   29982.719     0.971875        25579        35.56
   30146.559     0.975000        25660        40.00
   30310.399     0.978125        25750        45.71
   30457.855     0.981250        25829        53.33
   30605.311     0.984375        25903        64.00
   30670.847     0.985938        25947        71.11
   30769.151     0.987500        25990        80.00
   30883.839     0.989062        26031        91.43
   31080.447     0.990625        26072       106.67
   31195.135     0.992188        26112       128.00
   31244.287     0.992969        26132       142.22
   31293.439     0.993750        26150       160.00
   31358.975     0.994531        26175       182.86
   31424.511     0.995313        26192       213.33
   31522.815     0.996094        26215       256.00
   31588.351     0.996484        26224       284.44
   31621.119     0.996875        26232       320.00
   31686.655     0.997266        26243       365.71
   31735.807     0.997656        26254       426.67
   31784.959     0.998047        26263       512.00
   31850.495     0.998242        26268       568.89
   31883.263     0.998437        26275       640.00
   31965.183     0.998633        26281       731.43
   32030.719     0.998828        26284       853.33
   32063.487     0.999023        26289      1024.00
   32079.871     0.999121        26291      1137.78
   32112.639     0.999219        26294      1280.00
   32161.791     0.999316        26299      1462.86
   32161.791     0.999414        26299      1706.67
   32473.087     0.999512        26302      2048.00
   32489.471     0.999561        26303      2275.56
   32505.855     0.999609        26305      2560.00
   32587.775     0.999658        26306      2925.71
   32735.231     0.999707        26307      3413.33
   32800.767     0.999756        26308      4096.00
   32849.919     0.999780        26309      4551.11
   32849.919     0.999805        26309      5120.00
   33013.759     0.999829        26310      5851.43
   33128.447     0.999854        26311      6826.67
   33128.447     0.999878        26311      8192.00
   33144.831     0.999890        26312      9102.22
   33144.831     0.999902        26312     10240.00
   33144.831     0.999915        26312     11702.86
   33210.367     0.999927        26313     13653.33
   33210.367     0.999939        26313     16384.00
   33210.367     0.999945        26313     18204.44
   33210.367     0.999951        26313     20480.00
   33210.367     0.999957        26313     23405.71
   33357.823     0.999963        26314     27306.67
   33357.823     1.000000        26314          inf
#[Mean    =     6995.055, StdDeviation   =    11797.113]
#[Max     =    33341.440, Total count    =        26314]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26641 requests in 15.00m, 349.07MB read
  Socket errors: connect 0, read 0, write 7, timeout 0
Requests/sec:     29.60
Transfer/sec:    397.15KB